In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("DV&OHE.csv")

In [4]:
df

        town  area   price
0     khulna  2600  550000
1     khulna  3000  565000
2     khulna  3200  610000
3     khulna  3600  680000
4     khulna  4000  725000
5   Dinajpur  2600  585000
6   Dinajpur  2800  615000
7   Dinajpur  3300  650000
8   Dinajpur  3600  710000
9      Dhaka  2600  575000
10     Dhaka  2900  600000
11     Dhaka  3100  620000
12     Dhaka  3600  695000

In [6]:
dummies=pd.get_dummies(df.town)

In [7]:
dummies

    Dhaka  Dinajpur  khulna
0       0         0       1
1       0         0       1
2       0         0       1
3       0         0       1
4       0         0       1
5       0         1       0
6       0         1       0
7       0         1       0
8       0         1       0
9       1         0       0
10      1         0       0
11      1         0       0
12      1         0       0

In [9]:
merged=pd.concat([df,dummies],axis='columns')

In [10]:
merged

        town  area   price  Dhaka  Dinajpur  khulna
0     khulna  2600  550000      0         0       1
1     khulna  3000  565000      0         0       1
2     khulna  3200  610000      0         0       1
3     khulna  3600  680000      0         0       1
4     khulna  4000  725000      0         0       1
5   Dinajpur  2600  585000      0         1       0
6   Dinajpur  2800  615000      0         1       0
7   Dinajpur  3300  650000      0         1       0
8   Dinajpur  3600  710000      0         1       0
9      Dhaka  2600  575000      1         0       0
10     Dhaka  2900  600000      1         0       0
11     Dhaka  3100  620000      1         0       0
12     Dhaka  3600  695000      1         0       0

In [11]:
final= merged.drop(['town','Dhaka'],axis='columns')

In [12]:
final

    area   price  Dinajpur  khulna
0   2600  550000         0       1
1   3000  565000         0       1
2   3200  610000         0       1
3   3600  680000         0       1
4   4000  725000         0       1
5   2600  585000         1       0
6   2800  615000         1       0
7   3300  650000         1       0
8   3600  710000         1       0
9   2600  575000         0       0
10  2900  600000         0       0
11  3100  620000         0       0
12  3600  695000         0       0

In [16]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()

In [17]:
x=final.drop('price',axis="columns")

In [18]:
x

    area  Dinajpur  khulna
0   2600         0       1
1   3000         0       1
2   3200         0       1
3   3600         0       1
4   4000         0       1
5   2600         1       0
6   2800         1       0
7   3300         1       0
8   3600         1       0
9   2600         0       0
10  2900         0       0
11  3100         0       0
12  3600         0       0

In [19]:
y=final.price

In [20]:
model.fit(x,y)

LinearRegression()

In [23]:
model.predict([[2600,0,1]])

array([539709.73984091])

In [24]:
model.score(x,y)

0.9573929037221873

<h3>one hot encoding

In [25]:
df

        town  area   price
0     khulna  2600  550000
1     khulna  3000  565000
2     khulna  3200  610000
3     khulna  3600  680000
4     khulna  4000  725000
5   Dinajpur  2600  585000
6   Dinajpur  2800  615000
7   Dinajpur  3300  650000
8   Dinajpur  3600  710000
9      Dhaka  2600  575000
10     Dhaka  2900  600000
11     Dhaka  3100  620000
12     Dhaka  3600  695000

In [26]:
from sklearn.preprocessing import LabelEncoder

In [28]:
le=LabelEncoder()

In [29]:
dfle=df

In [31]:
dfle.town=le.fit_transform(dfle.town)

In [32]:
dfle

    town  area   price
0      2  2600  550000
1      2  3000  565000
2      2  3200  610000
3      2  3600  680000
4      2  4000  725000
5      1  2600  585000
6      1  2800  615000
7      1  3300  650000
8      1  3600  710000
9      0  2600  575000
10     0  2900  600000
11     0  3100  620000
12     0  3600  695000

In [37]:
x=dfle[['town','area']].values

In [38]:
x

array([[   2, 2600],
       [   2, 3000],
       [   2, 3200],
       [   2, 3600],
       [   2, 4000],
       [   1, 2600],
       [   1, 2800],
       [   1, 3300],
       [   1, 3600],
       [   0, 2600],
       [   0, 2900],
       [   0, 3100],
       [   0, 3600]], dtype=int64)

In [39]:
y=dfle.price

In [53]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [55]:
ct = ColumnTransformer([('town', OneHotEncoder(), [0])], remainder = 'passthrough')

In [57]:
x=ct.fit_transform(x)

In [58]:
x=x[:,1:]

In [59]:
x

array([[0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 3.0e+03],
       [0.0e+00, 1.0e+00, 3.2e+03],
       [0.0e+00, 1.0e+00, 3.6e+03],
       [0.0e+00, 1.0e+00, 4.0e+03],
       [1.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 2.8e+03],
       [1.0e+00, 0.0e+00, 3.3e+03],
       [1.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 2.9e+03],
       [0.0e+00, 0.0e+00, 3.1e+03],
       [0.0e+00, 0.0e+00, 3.6e+03]])

In [60]:
model.fit(x,y)

LinearRegression()

In [62]:
model.predict([[0,1,3400]])

array([641227.69296925])

In [63]:
model.score(x,y)

0.9573929037221872